package ch13;

public class 쓰레드의동기화Ex1 {
    public static void main(String[] args) {
        /*
            쓰레드의 동기화(synchronization) - 한 쓰레드가 진행중인 작업을 다른 쓰레드가 간섭하지 못하게 막는 것
                : 멀티 쓰레드 프로세스에서는 다른 쓰레드의 작업에 영향을 미칠 수 있다.
                : 진행중인 작업이 다른 쓰레드에게 간섭받지 않게 하려면 '동기화'가 필요
                : 동기화하려면 간섭받지 않아야 하는 문장들을 '임계영역'으로 설정
                : 임계영역은 락(lock)을 얻은 단 하나의 쓰레드만 출입가능(객체 1개에 락 1개)


            synchronized를 이용한 동기화
            synchronized로 임계영역(lock이 걸리는영역)을 설정하는 방법 2가지
                1. 메서드 전체를 임계 영역으로 지정
                2. 특정한 영역을 임계 영역으로 지정

            - 동기화의 효율을 높이기 위해 wait(), notify()를 사용, 기다리기, 알려주기
            - Object클래스에 정의되어 있으며, 동기화 블록 내에서만 사용할 수 있다.

            * 요리사는 Table에 음식을 추가. 손님은 Table의 음식을 소비
                요리사와 손님이 같은 객체(Table)을 공유하므로 동기화가 필요

        */
    }
}

